
* Run =bundle install= to install GEMS


#+BEGIN_SRC sh :eval no-export :exports none
rm -f  Gemfile.lock
#+END_SRC

#+RESULTS:

#+name: bundle-install
#+BEGIN_SRC sh :eval no-export :results output
bundle install
#+END_SRC

#+RESULTS: bundle-install
#+begin_example
The latest bundler is 1.16.1, but you are currently running 1.15.4.
To update, run `gem install bundler`
Fetching gem metadata from https://rubygems.org/...........
Fetching version metadata from https://rubygems.org/.
Resolving dependencies...
Using public_suffix 3.0.1
Using bundler 1.15.4
Using ffi 1.9.21
Using hashie 3.5.7
Using mustache 1.0.5
Using polyglot 0.3.5
Using thor 0.20.0
Using addressable 2.5.2
Using treetop 1.6.9
Using json-schema 2.8.0
Using tla-parser-s 0.2.5
Using tla-sbuilder 0.3.9
Using tla-trace-filter 0.0.6
Using tla-trace-arch 0.1.1
Bundle complete! 2 Gemfile dependencies, 14 gems now installed.
Use `bundle info [gemname]` to see where a bundled gem is installed.
#+end_example


* Install TLA+tools =tla2tools.jar=

 Download TLA+ Tools distribution package =tla2tools.jar= to a local =java= -directory

 #+name: install-tla-tools
 #+BEGIN_SRC sh  :eval no-export :exports code :results output
 mkdir java
 wget https://tla.msr-inria.inria.fr/tlatoolbox/dist/tla2tools.jar -O java/tla2tools.jar
 #+END_SRC

 #+RESULTS: install-tla-tools

#+name: ls-java
#+BEGIN_SRC sh :eval no-export :exports none :results output
ls -l java
#+END_SRC

#+RESULTS: ls-java
: total 2348
: -rw-rw-r-- 1 jj jj 2401057 tammi 29 14:58 tla2tools.jar

TLA+tool versions used to create this document are

 #+name: pcal-version
 #+BEGIN_SRC sh  :eval no-export :exports results :results output
   TLATOOLS_JAR=java/tla2tools.jar; java -cp $TLATOOLS_JAR pcal.trans -version | grep Version
 #+END_SRC

 #+RESULTS: pcal-version
 : pcal.trans Version 1.8 of 18 Aug 2015

for TLA+tools pcal translator, and 

 #+BEGIN_SRC sh  :eval no-export :exports results :results output
   TLATOOLS_JAR=java/tla2tools.jar; java -cp $TLATOOLS_JAR tlc2.TLC -help | grep Version
 #+END_SRC

 #+RESULTS:
 : TLC2 Version 2.12 of 29 January 2018 (rev: 2cf4197)

for TLA+tools TLC model checker.


